Comments revised
